<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"ca27d673511141e2ed6a0d691bf256bd1d21585867cfab8f56b627712e254244","plan_job_ref":"Job Staging Image Build & Push #47 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439355902","plan_hash":"db575ccedf07550e6febe630096e6ae19924527beb44663b3242eef3da270762","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.ASG_config will be updated in-place
!~  resource "aws_autoscaling_group" "ASG_config" {
+       desired_capacity_type            = "units"
        id                               = "fastapi-ASG-dev"
        name                             = "fastapi-ASG-dev"
#        (26 unchanged attributes hidden)

!~      launch_template {
!~          id   = "********************" -> (known after apply)
            name = "LaunchTemplateECR20240107155024896300000001"
        }

#        (3 unchanged blocks hidden)
    }

  # aws_launch_template.ASG_template will be created
+   resource "aws_launch_template" "ASG_template" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       id              = (known after apply)
+       image_id        = (sensitive value)
+       instance_type   = "t2.micro"
+       latest_version  = (known after apply)
+       name            = (known after apply)
+       name_prefix     = "LaunchTemplateECR"
+       tags_all        = {
+           "Environment" = "Dev Environment"
        }
+       user_data       = "IyEvYmluL2Jhc2gKZWNobyAiRUNTX0NMVVNURVI9ZmFzdGFwaS1jbHVzdGVyIiA+PiAvZXRjL2Vjcy9lY3MuY29uZmln"

+       iam_instance_profile {
+           name = "InstanceRoleForECS"
        }

+       network_interfaces {
+           associate_public_ip_address = "true"
+           security_groups             = [
+               "sg-091e964d65dee5150",
            ]
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #47](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439355902)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>